# Rank Users within Groups

We have a table with users, their country and when they created the account. We want to find:

* The country with the largest and smallest number of users

* A query that returns for each country the first and the last user who signed up (if that country has just one user, it should just return that single user)

<img src="./within.png">

In [1]:
import pandas as pd

users_url = 'https://raw.githubusercontent.com/data-eng-10-21/interview-questions/main/ds-sql/5-rank-within-groups/query_six-1.csv'
users_df = pd.read_csv(users_url)

In [2]:
import sqlite3
conn = sqlite3.connect('crm.db')

In [3]:
users_df.to_sql('users', conn)

58727

In [5]:
pd.read_sql('select * from users', conn)

       index  user_id           created_at   country
0          0        2  2015-02-28 16:00:40     China
1          1       16  2015-02-28 16:05:15     China
2          2       22  2015-02-28 16:09:56     India
3          3       37  2015-02-28 16:26:44   Vietnam
4          4       61  2015-02-28 16:29:57     India
...      ...      ...                  ...       ...
58722  58722   999845  2015-09-29 16:40:56     India
58723  58723   999896  2015-09-29 16:45:45     India
58724  58724   999897  2015-09-29 16:48:33   Nigeria
58725  58725   999913  2015-09-29 16:49:46  Pakistan
58726  58726   999926  2015-09-29 16:56:16     India

[58727 rows x 4 columns]

```sql

````

### Solution

<img src="./query-group.png">

Or

<img src="./also.png" width="70%">